<script setup>
import { useAppStore } from "@/stores/app";
import StatsWidget from "@/@core/components/widgets/StatsWidget";
import TeamWidget from "@/@core/components/widgets/TeamWidget";
import { format } from "@core/utils/formatters";
import { hasPermission } from "@core/utils/permissions";
import { canAccessObserverInfo } from "@core/utils/permissions";
import { useLayouts } from "@layouts";
import Pagination from "@/@core/components/Pagination.vue";
import dataTable from "@/components/dataTable.vue";
import Editicon from "@/components/icons/editicon.vue";
import Trash from "@/components/icons/trash.vue";
import Eyeicon from "@/components/icons/eyeicon.vue";
import Airplane from "@/components/icons/airplane.vue";
import Realstate from "@/components/icons/realstate.vue";
import Usergroup from "@/components/icons/usergroup.vue";

import axios from "@/plugins/axios";
const appStore = useAppStore();
const { isAppRtl } = useLayouts();
const headers = ref([
  { title: "رقم الترخيص", value: "licenseNumber" },
  { title: "اسم الشركة", value: "companyName" },
  { title: "عدد الحجاج المرتبطين", value: "connectedHujjaj", align: "start" },
  { title: "وسيلة الاتصال", value: "contactNumber" },
  { title: "", value: "actions" },
]);

const currentPage = ref(1);
const perPage = ref(5); // Set to match the API response of 4 items per page
const teamLocation = ref();
const homeData = ref({});
const search = ref(""); // Added this line to define the search variable used in the template
const isLoading = ref(true);
const isExporting = ref(false);
const loading = ref(false);
const filterMenu = ref(false);
const activeTab = ref("companies");
const sites = ref([]);
const totalItems = ref(0);
const companies = ref([
  {
    connectedHujjaj: 34,
    licenseNumber: "1966 555 555 555",
    companyName: "34 حاج",
    contactNumber: "2378903242",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 20,
    licenseNumber: "1966 500 123 456",
    companyName: "20 حاج",
    contactNumber: "1234567890",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 15,
    licenseNumber: "1966 511 234 567",
    companyName: "15 حاج",
    contactNumber: "0987654321",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 50,
    licenseNumber: "1966 522 345 678",
    companyName: "50 حاج",
    contactNumber: "1357924680",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 25,
    licenseNumber: "1966 533 456 789",
    companyName: "25 حاج",
    contactNumber: "2468135790",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 40,
    licenseNumber: "1966 544 567 890",
    companyName: "40 حاج",
    contactNumber: "9876543210",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 40,
    licenseNumber: "1966 544 567 890",
    companyName: "40 حاج",
    contactNumber: "9876543210",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 40,
    licenseNumber: "1966 544 567 890",
    companyName: "40 حاج",
    contactNumber: "9876543210",
    actions: {edit:true}
  },
  {
    connectedHujjaj: 40,
    licenseNumber: "1966 544 567 890",
    companyName: "40 حاج",
    contactNumber: "9876543210",
    actions: {edit:true}
  },
]);
const flights = ref([]);
const pilgrims = ref([]);

// Fetch statistics data
const fetchHomeData = async () => {
  try {
    isLoading.value = true;
    const queryParams = new URLSearchParams({
      page: currentPage.value.toString(),
    });

    // const response = await axios.get(`/statistics?${queryParams.toString()}`);
    // if (response.data) {
    //   homeData.value = response.data;
    // }
  } catch (error) {
    console.error("Error fetching home statistics:", error);
    appStore.showSnackbar({
      message: "حدث خطأ أثناء جلب البيانات",
      color: "error",
    });
    homeData.value = null;
  } finally {
    isLoading.value = false;
  }
};

// Function to handle page changes for locations
const handleLocationPageChange = (page) => {
  currentPage.value = page;
  fetchHomeData();
};
watch(activeTab , ()=>{
  console.log("watch change");

  switch (activeTab.value) {
    case "companies":
      totalItems.value = companies.value.length
      break;
    case "flights":
      totalItems.value = flights.value.length
      break;
    case "pilgrims":
      totalItems.value = pilgrims.value.length
      break;
    default:
      break;
  }
} ,{immediate:true})
onMounted(() => {
  fetchHomeData();
});

</script>

<template>
  <div>
    <v-container fluid class="px-0 px-sm-4 px-xl-0 py-2 pt-0">
      <v-row v-if="isLoading">
        <v-col v-for="item in 4" :key="item" cols="6" sm="6" md="3">
          <VCard elevation="0" class="py-2">
            <v-card-text class="px-1 py-2">
              <v-skeleton-loader
                class="mx-auto"
                elevation="0"
                max-width="400"
                type="list-item-two-line, table-heading"
              ></v-skeleton-loader>
            </v-card-text>
          </VCard>
        </v-col>
      </v-row>
      <v-row v-else-if="!isLoading">
        <v-col cols="6" md="3" lg="3">
          <StatsWidget
            title="عدد الشركات"
            :number="homeData?.data?.statistics?.camps_count || 0"
          >
            <template #icon>
              <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
<g opacity="0.4">
<path d="M41.4478 10.751C42 11.6772 42 12.7748 42 14.9698L42 44H28L28 9.93491C28 6.48917 28 4.7663 29.2323 4.17425C30.4647 3.58219 32.0615 4.53787 35.2553 6.44922L37.8439 7.99842C39.8784 9.21599 40.8956 9.82481 41.4478 10.751Z" fill="#9C8055"/>
<path d="M6.55219 10.751C6 11.6772 6 12.7748 6 14.9698L6 44H20L20 9.93491C20 6.48917 20 4.7663 18.7677 4.17425C17.5353 3.58219 15.9385 4.53787 12.7447 6.44922L10.1561 7.99842C8.12162 9.21601 7.10437 9.8248 6.55219 10.751Z" fill="#9C8055"/>
</g>
<path d="M10.9844 16C10.9844 14.8954 11.8798 14 12.9844 14H13.0023C14.1069 14 15.0023 14.8954 15.0023 16C15.0023 17.1046 14.1069 18 13.0023 18H12.9844C11.8798 18 10.9844 17.1046 10.9844 16Z" fill="#9C8055"/>
<path d="M10.9844 24C10.9844 22.8954 11.8798 22 12.9844 22H13.0023C14.1069 22 15.0023 22.8954 15.0023 24C15.0023 25.1046 14.1069 26 13.0023 26H12.9844C11.8798 26 10.9844 25.1046 10.9844 24Z" fill="#9C8055"/>
<path d="M10.9844 32C10.9844 30.8954 11.8798 30 12.9844 30H13.0023C14.1069 30 15.0023 30.8954 15.0023 32C15.0023 33.1046 14.1069 34 13.0023 34H12.9844C11.8798 34 10.9844 33.1046 10.9844 32Z" fill="#9C8055"/>
<path d="M34.9844 14C33.8798 14 32.9844 14.8954 32.9844 16C32.9844 17.1046 33.8798 18 34.9844 18H35.0023C36.1069 18 37.0023 17.1046 37.0023 16C37.0023 14.8954 36.1069 14 35.0023 14H34.9844Z" fill="#9C8055"/>
<path d="M34.9844 22C33.8798 22 32.9844 22.8954 32.9844 24C32.9844 25.1046 33.8798 26 34.9844 26H35.0023C36.1069 26 37.0023 25.1046 37.0023 24C37.0023 22.8954 36.1069 22 35.0023 22H34.9844Z" fill="#9C8055"/>
<path d="M34.9844 30C33.8798 30 32.9844 30.8954 32.9844 32C32.9844 33.1046 33.8798 34 34.9844 34H35.0023C36.1069 34 37.0023 33.1046 37.0023 32C37.0023 30.8954 36.1069 30 35.0023 30H34.9844Z" fill="#9C8055"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M41.0841 8.27095C41.7496 8.75502 42.317 9.27964 42.7362 9.98291C43.1603 10.6942 43.3401 11.4323 43.423 12.2296C43.5001 12.9722 43.5001 13.8617 43.5 14.8979L43.5 42.5H44C44.8284 42.5 45.5 43.1716 45.5 44C45.5 44.8284 44.8284 45.5 44 45.5H42.0049L42 45.5H28L27.9952 45.5H20.0048L20 45.5L5.99999 45.5L5.99515 45.5H4C3.17157 45.5 2.5 44.8284 2.5 44C2.5 43.1716 3.17157 42.5 4 42.5H4.49999L4.49998 14.8979C4.49994 13.8617 4.49991 12.9722 4.57704 12.2296C4.65985 11.4323 4.8397 10.6942 5.26376 9.98291C5.68303 9.27964 6.25043 8.75502 6.91593 8.27095C7.54839 7.81091 8.36017 7.3251 9.32949 6.74503L12.0724 5.10351C13.5856 4.19781 14.8572 3.43671 15.9062 2.99196C16.9808 2.53633 18.207 2.24075 19.4172 2.8222C20.6853 3.43144 21.1402 4.61206 21.326 5.74073C21.5002 6.79867 21.5001 8.19343 21.5 9.8046L21.5 16.5H26.5L26.5 9.80463C26.4999 8.19346 26.4998 6.79867 26.674 5.74073C26.8598 4.61206 27.3147 3.43144 28.5828 2.8222C29.793 2.24075 31.0192 2.53633 32.0938 2.99196C33.1428 3.43671 34.4143 4.19774 35.9275 5.10344L38.6705 6.74505C39.6396 7.32496 40.4518 7.811 41.0841 8.27095ZM21.5 19.5L26.5 19.5L26.5 28.5L21.5 28.5L21.5 19.5ZM21.5 31.5L26.5 31.5L26.5 42.5H21.5L21.5 31.5ZM18.5 42.5L18.5 9.93492C18.5 8.15548 18.4951 7.0127 18.3659 6.22818C18.3044 5.85461 18.2296 5.67331 18.1827 5.59247C18.1545 5.54373 18.1437 5.53857 18.1203 5.52736L18.1181 5.52631L18.1162 5.52536C18.0864 5.51043 17.8874 5.41049 17.0772 5.75396C16.2439 6.1073 15.1523 6.75646 13.515 7.73633L10.9264 9.28553C9.88614 9.9081 9.19125 10.3256 8.68062 10.697C8.19082 11.0533 7.9735 11.2962 7.84058 11.5191C7.71246 11.7341 7.61622 12.0078 7.56098 12.5396C7.50184 13.109 7.49999 13.8418 7.49999 14.9698L7.49999 42.5L18.5 42.5ZM40.5 14.9698L40.5 42.5H29.5L29.5 9.93492C29.5 8.15548 29.5049 7.0127 29.6341 6.22818C29.6956 5.85461 29.7704 5.67331 29.8173 5.59247C29.8455 5.54373 29.8563 5.53857 29.8797 5.52736L29.8819 5.52631L29.8838 5.52536C29.9136 5.51043 30.1126 5.41049 30.9228 5.75396C31.7561 6.1073 32.8477 6.75646 34.485 7.73633L37.0736 9.28553C38.1139 9.9081 38.8088 10.3256 39.3194 10.697C39.8092 11.0533 40.0265 11.2962 40.1594 11.5191C40.2875 11.7341 40.3838 12.0078 40.439 12.5396C40.4982 13.109 40.5 13.8418 40.5 14.9698Z" fill="#9C8055"/>
</svg>

            </template>
          </StatsWidget>
        </v-col>
        <v-col cols="6" md="3" lg="3">
          <StatsWidget
            title="عدد الحجاج داخل السوبردوم"
            :number="homeData?.data?.statistics?.locations_count || 0"
          >
            <template #icon>
              <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
<g opacity="0.4">
<path d="M16.9998 17C16.9998 19.7614 14.7612 22 11.9998 22C9.23833 22 6.99976 19.7614 6.99976 17C6.99976 14.2386 9.23833 12 11.9998 12C14.7612 12 16.9998 14.2386 16.9998 17Z" fill="#9C8055"/>
<path d="M40.9998 17C40.9998 19.7614 38.7612 22 35.9998 22C33.2383 22 30.9998 19.7614 30.9998 17C30.9998 14.2386 33.2383 12 35.9998 12C38.7612 12 40.9998 14.2386 40.9998 17Z" fill="#9C8055"/>
<path d="M15.471 30.6378C15.7281 30.4868 15.9641 30.3481 16.1674 30.2224C20.9595 27.2592 27.04 27.2592 31.8321 30.2224C32.0354 30.3481 32.2714 30.4868 32.5285 30.6378C34.8562 32.0056 38.9092 34.3873 35.9704 37.2948C34.3762 38.872 32.6007 40 30.3685 40H17.631C15.3988 40 13.6233 38.872 12.0292 37.2948C9.0903 34.3873 13.1433 32.0057 15.471 30.6378Z" fill="#9C8055"/>
</g>
<path fill-rule="evenodd" clip-rule="evenodd" d="M15.4998 15C15.4998 10.3056 19.3053 6.5 23.9998 6.5C28.6942 6.5 32.4998 10.3056 32.4998 15C32.4998 19.6944 28.6942 23.5 23.9998 23.5C19.3053 23.5 15.4998 19.6944 15.4998 15ZM23.9998 9.5C20.9622 9.5 18.4998 11.9624 18.4998 15C18.4998 18.0376 20.9622 20.5 23.9998 20.5C27.0373 20.5 29.4998 18.0376 29.4998 15C29.4998 11.9624 27.0373 9.5 23.9998 9.5Z" fill="#9C8055"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M15.3788 28.9466C20.6543 25.6845 27.3458 25.6845 32.6213 28.9466C32.7768 29.0427 32.9737 29.158 33.2 29.2904C34.2246 29.8899 35.8511 30.8417 36.961 31.9698C37.658 32.6783 38.3532 33.6442 38.4799 34.8484C38.6156 36.1367 38.0688 37.3291 37.0256 38.3612C35.3024 40.0661 33.1677 41.5 30.3688 41.5H17.6313C14.8324 41.5 12.6977 40.0661 10.9745 38.3612C9.93135 37.3291 9.38455 36.1367 9.52015 34.8484C9.6469 33.6442 10.3421 32.6783 11.0391 31.9698C12.149 30.8417 13.7753 29.89 14.7999 29.2905C15.0262 29.158 15.2232 29.0428 15.3788 28.9466ZM31.0436 31.4982C26.7349 28.8339 21.2652 28.8339 16.9565 31.4982C16.6979 31.6581 16.4206 31.8216 16.1345 31.9903C15.1107 32.594 13.9742 33.2641 13.1777 34.0737C12.6877 34.5717 12.5276 34.9352 12.5037 35.1624C12.4886 35.3054 12.4958 35.6462 13.0844 36.2285C14.5495 37.678 15.9658 38.5 17.6313 38.5H30.3688C32.0343 38.5 33.4506 37.678 34.9157 36.2285C35.5043 35.6462 35.5115 35.3054 35.4964 35.1624C35.4725 34.9352 35.3124 34.5717 34.8224 34.0737C34.0259 33.2641 32.8895 32.594 31.8657 31.9904C31.5796 31.8217 31.3022 31.6581 31.0436 31.4982Z" fill="#9C8055"/>
<path d="M4.49984 17C4.49984 13.4101 7.40999 10.5 10.9998 10.5C11.8283 10.5 12.4998 11.1716 12.4998 12C12.4998 12.8284 11.8283 13.5 10.9998 13.5C9.06685 13.5 7.49984 15.067 7.49984 17C7.49984 18.933 9.06685 20.5 10.9998 20.5C11.8283 20.5 12.4998 21.1716 12.4998 22C12.4998 22.8284 11.8283 23.5 10.9998 23.5C7.40999 23.5 4.49984 20.5899 4.49984 17Z" fill="#9C8055"/>
<path d="M9.86469 24.5061C10.6897 24.4315 11.4191 25.0398 11.4937 25.8648C11.5684 26.6899 10.9601 27.4193 10.135 27.4939C8.85438 27.6098 7.56505 28.1044 6.38432 29.0137C6.19408 29.1602 5.99661 29.3053 5.79746 29.4517C5.11826 29.9509 4.41948 30.4645 3.921 31.0955C3.62504 31.4701 3.51928 31.7517 3.50248 31.9505C3.48966 32.1021 3.51126 32.3688 3.8556 32.793C4.84638 34.0138 5.65274 34.5 6.45176 34.5C7.28019 34.5 7.95176 35.1716 7.95176 36C7.95176 36.8284 7.28019 37.5 6.45176 37.5C4.25357 37.5 2.67597 36.1001 1.52627 34.6836C0.775153 33.7581 0.424801 32.7429 0.513135 31.6978C0.597481 30.6999 1.06596 29.87 1.56692 29.2358C2.35095 28.2434 3.51414 27.3971 4.19551 26.9014C4.339 26.7971 4.46125 26.7081 4.55395 26.6367C6.16254 25.398 7.98764 24.6759 9.86469 24.5061Z" fill="#9C8055"/>
<path d="M34.4998 12C34.4998 11.1716 35.1713 10.5 35.9998 10.5C39.5896 10.5 42.4998 13.4101 42.4998 17C42.4998 20.5899 39.5896 23.5 35.9998 23.5C35.1713 23.5 34.4998 22.8284 34.4998 22C34.4998 21.1716 35.1713 20.5 35.9998 20.5C37.9328 20.5 39.4998 18.933 39.4998 17C39.4998 15.067 37.9328 13.5 35.9998 13.5C35.1713 13.5 34.4998 12.8284 34.4998 12Z" fill="#9C8055"/>
<path d="M36.5059 25.8648C36.5805 25.0398 37.3098 24.4315 38.1349 24.5061C40.012 24.6759 41.8371 25.398 43.4456 26.6367C43.5383 26.7081 43.6604 26.7969 43.8038 26.9013C44.4852 27.397 45.6487 28.2434 46.4327 29.2358C46.9336 29.87 47.4021 30.6999 47.4865 31.6978C47.5748 32.7429 47.2244 33.7581 46.4733 34.6836C45.3236 36.1001 43.746 37.5 41.5478 37.5C40.7194 37.5 40.0478 36.8284 40.0478 36C40.0478 35.1716 40.7194 34.5 41.5478 34.5C42.3469 34.5 43.1532 34.0138 44.144 32.793C44.4883 32.3688 44.5099 32.1021 44.4971 31.9505C44.4803 31.7517 44.3746 31.4701 44.0786 31.0955C43.5801 30.4645 42.8813 29.9509 42.2021 29.4517C42.003 29.3053 41.8055 29.1601 41.6153 29.0137C40.4346 28.1044 39.1452 27.6098 37.8646 27.4939C37.0395 27.4193 36.4312 26.6899 36.5059 25.8648Z" fill="#9C8055"/>
</svg>

            </template>
          </StatsWidget>
        </v-col>
        <v-col cols="6" md="3" lg="3">
          <StatsWidget
            title="عدد الرحلات"
            :number="homeData.data?.statistics.main_companies_count || 0"
          >
            <template #icon>
              <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
<path opacity="0.4" d="M5.53055 17.8256L4.95655 15.6716C4.55455 14.1656 4.35255 13.4117 4.63055 12.7857C5.11655 11.6937 6.55655 11.5057 7.57655 11.2317C8.55655 10.9657 9.04856 10.8336 9.51256 10.9296C10.6226 11.1576 11.4405 12.4996 12.1665 13.3056C13.8265 15.1516 14.6225 15.2736 16.8485 14.1996C20.6145 12.3816 24.3685 10.5397 28.1465 8.74769C33.7065 6.11169 40.4945 7.77565 44.1465 12.7577C44.9605 13.8897 44.2925 15.4357 43.0005 15.7857L32.6846 18.5657C32.1546 18.7097 31.7086 19.0717 31.4606 19.5657L29.0046 24.4216C28.4746 25.3196 27.6065 25.9776 26.5905 26.2516L22.0685 27.4697C21.3565 27.6617 20.6985 27.0517 20.8505 26.3397L21.7566 22.0977C21.8166 21.8137 21.5565 21.5637 21.2765 21.6397L15.1885 23.2796C11.5805 24.2536 9.77456 24.7397 8.36056 23.9397C6.94656 23.1417 6.47455 21.3696 5.53055 17.8256Z" fill="#9C8055"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M21.171 28.9392C21.271 28.9672 21.439 29.0051 21.713 29.0051C22.133 29.0051 22.805 28.9132 23.871 28.5572C23.9618 28.5269 24.2432 28.4547 24.5379 28.379C24.613 28.3597 24.689 28.3402 24.763 28.3211C24.8047 28.3104 24.8471 28.2995 24.8903 28.2884C25.6926 28.0821 26.7393 27.813 27.489 27.5511L27.509 27.5432C29.025 26.9932 30.139 25.6912 30.605 24.5992C30.835 24.1972 31.197 23.4712 31.737 22.3772C32.105 21.6312 32.651 20.5271 32.841 20.2011C32.889 20.1531 32.947 20.1032 33.039 20.0692C34.2539 19.7302 36.3276 19.1688 38.2325 18.653C38.598 18.5541 38.9572 18.4568 39.303 18.3631L39.8104 18.2257C41.7783 17.6928 42.9054 17.3876 43.127 17.3211L43.205 17.2972L43.2081 17.2963C43.7806 17.1276 45.286 16.6839 45.829 14.9251L45.851 14.8472C46.277 13.1432 45.691 12.2911 44.699 11.0511C44.073 10.2291 42.177 8.39313 39.341 7.17513C35.695 5.60713 31.761 5.61716 27.967 7.19916L27.929 7.21517C27.4247 7.44152 24.6851 8.76374 21.7709 10.1703L21.707 10.2011C19.107 11.4571 15.873 13.0172 15.567 13.1492C15.123 13.3332 14.809 13.4092 14.579 13.3892C14.425 13.3752 14.117 13.1852 13.905 12.9732L13.799 12.8671L13.741 12.8291C13.623 12.7091 13.357 12.3912 13.159 12.1532C11.997 10.7612 11.149 9.81714 10.181 9.58314C9.32699 9.32714 8.47299 9.46914 8.03099 9.57914L7.96898 9.59515C5.54298 10.1992 5.05299 10.4272 4.75899 10.6072C3.92099 11.1232 3.45299 11.6492 3.15699 12.4152C2.81499 13.2252 3.04098 14.2832 3.74498 16.9652C4.22498 18.7912 4.87099 21.1011 5.08299 21.6871C5.76099 23.6571 6.42098 24.4352 7.26498 25.0492L7.37499 25.1232C8.43099 25.7572 9.26698 25.8871 10.197 25.8871C10.757 25.8871 12.603 25.6231 15.985 24.6371C16.797 24.4391 17.981 24.1251 19.167 23.7911C19.429 23.7311 19.679 23.6692 19.911 23.6072C19.775 24.2952 19.551 25.3831 19.425 25.8251C19.225 26.5271 19.305 27.2372 19.655 27.8232C19.985 28.3792 20.537 28.7832 21.171 28.9392ZM22.509 25.8411C22.707 24.9611 22.921 23.8452 22.971 23.5652L22.977 23.5612C22.9856 23.5267 22.9972 23.4862 23.0105 23.4397C23.0126 23.4324 23.0148 23.4248 23.017 23.4171L23.018 23.4136C23.206 22.7555 23.49 21.7617 22.927 20.9411C22.749 20.6811 22.505 20.4772 22.223 20.3472C21.5911 19.9933 20.8012 20.2271 20.0853 20.4391C19.6473 20.5691 19.101 20.7312 18.471 20.8732L18.395 20.8932C17.211 21.2252 16.035 21.5391 15.247 21.7291L15.179 21.7472C12.049 22.6612 10.447 22.8791 10.199 22.8871C9.69098 22.8871 9.41899 22.8391 8.97699 22.5831C8.71699 22.3911 8.39298 22.0851 7.91898 20.7011L7.90499 20.6631C7.79099 20.3571 7.23299 18.4232 6.65099 16.2072C6.43899 15.4032 6.06099 13.9611 6.00899 13.4091C6.05099 13.3571 6.12698 13.2952 6.29698 13.1892C6.41298 13.1412 6.91098 12.9551 8.69899 12.5091L8.76297 12.4932C9.01897 12.4292 9.25099 12.4372 9.32499 12.4612L9.37298 12.4772C9.72498 12.7192 10.489 13.6332 10.863 14.0812C11.329 14.6412 11.603 14.9612 11.869 15.1772C12.269 15.5572 13.167 16.2791 14.315 16.3831C15.267 16.4691 16.105 16.1832 16.729 15.9232C17.015 15.8032 18.959 14.8671 23.017 12.9091L23.3161 12.7648C25.976 11.4811 28.6419 10.1946 29.147 9.96517C37.031 6.68917 42.271 12.8151 42.319 12.8791L42.349 12.9171C42.531 13.1411 42.955 13.6692 42.999 13.8152C42.9992 13.8239 43.0009 13.8897 42.955 14.0812C42.905 14.2252 42.839 14.2852 42.365 14.4232L42.269 14.4511C42.0798 14.5077 40.7167 14.8769 39.1484 15.3017C38.9427 15.3574 38.7335 15.4141 38.523 15.4711C36.237 16.0891 33.647 16.7912 32.197 17.1932L32.135 17.2112C31.251 17.4972 30.753 18.0412 30.567 18.2472L30.495 18.3192L30.419 18.4272C30.191 18.7512 29.827 19.4752 29.049 21.0492L29.0299 21.0877C28.6127 21.9301 28.1463 22.8717 27.971 23.1652L27.905 23.2751L27.859 23.3952C27.703 23.7972 27.177 24.4731 26.493 24.7251C25.823 24.9571 24.781 25.2231 24.021 25.4171C23.441 25.5651 23.129 25.6472 22.923 25.7152C22.787 25.7612 22.645 25.8031 22.509 25.8411Z" fill="#9C8055"/>
<path d="M4.50195 41.0059H36.502C37.33 41.0059 38.002 40.3339 38.002 39.5059C38.002 38.6779 37.33 38.0059 36.502 38.0059H4.50195C3.67395 38.0059 3.00195 38.6779 3.00195 39.5059C3.00195 40.3339 3.67395 41.0059 4.50195 41.0059Z" fill="#9C8055"/>
</svg>

            </template>
          </StatsWidget>
        </v-col>
        <v-col cols="6" md="3" lg="3">
          <StatsWidget
            title="متوسط وقت الإنتظار"
            :number="homeData.data?.statistics?.companies_count || 0"
          >
            <template #icon>
              <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
<circle opacity="0.4" cx="22" cy="22" r="20" fill="#9C8055"/>
<path d="M23.5 14C23.5 13.1716 22.8284 12.5 22 12.5C21.1716 12.5 20.5 13.1716 20.5 14V22C20.5 22.3978 20.658 22.7794 20.9393 23.0607L24.9393 27.0607C25.5251 27.6464 26.4749 27.6464 27.0607 27.0607C27.6464 26.4749 27.6464 25.5251 27.0607 24.9393L23.5 21.3787V14Z" fill="#9C8055"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M22 0.5C10.1259 0.5 0.5 10.1259 0.5 22C0.5 33.8741 10.1259 43.5 22 43.5C33.8741 43.5 43.5 33.8741 43.5 22C43.5 10.1259 33.8741 0.5 22 0.5ZM3.5 22C3.5 11.7827 11.7827 3.5 22 3.5C32.2173 3.5 40.5 11.7827 40.5 22C40.5 32.2173 32.2173 40.5 22 40.5C11.7827 40.5 3.5 32.2173 3.5 22Z" fill="#9C8055"/>
</svg>

            </template>
          </StatsWidget>
        </v-col>
      </v-row>
      <!--  -->

      <v-row>
        <v-col cols="12">
          <VCard elevation="0" class="rounded-lg px-4 bg-light-white">
            <!-- Header Section -->
            <v-card-title class="pt-4 pb-6">
              <div class="">
                <div class="d-flex justify-space-between align-center">
                  <div
                    class="d-flex gap-2 border px-2 py-1"
                    style="border-radius: 16px; max-width: fit-content"
                  >
                    <v-btn
                      v-for="tab in [
                        { id: 'companies', label: 'الشركات ' },
                        { id: 'flights', label: 'الرحلات' },
                        { id: 'pilgrims', label: 'الحجاج' },
                      ]"
                      :key="tab.id"
                      elevation="0"
                      class="rounded-lg font-weight-bold"
                      :class="{
                        'bg-light-gray text-primary': activeTab === tab.id,
                        'bg-white text-gray-1': activeTab !== tab.id,
                      }"
                      @click="activeTab = tab.id"
                    >
                      <span class="responsive-text">{{ tab.label }}</span>
                    </v-btn>
                  </div>
                </div>
              </div>

              <!-- Content Section -->
              <v-window v-model="activeTab" class="mt-6">
                <!-- companies Tab -->
                <v-window-item value="companies">
                  <dataTable
                    :headers="headers"
                    :items="companies"
                    :loading="isLoading"
                    class="elevation-0"
                    :items-per-page="perPage"
                    v-model:page="currentPage"
                    :hide-default-footer="true"
                  >
                  <template #['item.actions']={item} >
                    <v-btn class="text-black" color="#fff" :prepend-icon="Editicon">
                      تعديل
                    </v-btn>
                  </template>
                  </dataTable>
                </v-window-item>

                <!-- flights Tab -->
                <v-window-item value="flights">
                  <v-row v-if="isLoading">
                    <v-col v-for="i in 6" :key="i" cols="12" sm="6" lg="4">
                      <v-skeleton-loader
                        class="mx-auto"
                        type="card"
                      ></v-skeleton-loader>
                    </v-col>
                  </v-row>
                  <v-row v-else-if="flights.length">
                    <v-col
                      v-for="travel in flights"
                      :key="travel.id"
                      cols="12"
                      sm="6"
                      lg="4"
                    >
                      <h1>travel</h1>
                    </v-col>
                  </v-row>
                  <v-row v-else>
                    <v-col cols="12" class="text-center">
                      <p class="text-medium-emphasis">لا توجد بيانات</p>
                    </v-col>
                  </v-row>
                </v-window-item>

                <!-- pilgrims Tab -->
                <v-window-item value="pilgrims">
                  <v-row v-if="isLoading">
                    <v-col v-for="i in 6" :key="i" cols="12" sm="6" lg="4">
                      <v-skeleton-loader
                        class="mx-auto"
                        type="card"
                      ></v-skeleton-loader>
                    </v-col>
                  </v-row>
                  <v-row v-else-if="pilgrims.length">
                    <v-col
                      v-for="pilgrim in pilgrims"
                      :key="pilgrim.id"
                      cols="12"
                      sm="6"
                      lg="4"
                    >
                      <h1>pilgrim</h1>
                    </v-col>
                  </v-row>
                  <v-row v-else>
                    <v-col cols="12" class="text-center">
                      <p class="text-medium-emphasis">لا توجد بيانات</p>
                    </v-col>
                  </v-row>
                </v-window-item>
              </v-window>

              <!-- Pagination -->
              <Pagination
                :total-items="totalItems"
                v-model:per-page="perPage"
                v-model:page="currentPage"
              />
            </v-card-title>
          </VCard>
        </v-col>
      </v-row>
    </v-container>
  </div>
</template>

<style lang="scss" scoped>
// @use "@core/scss/template/libs/apex-chart.scss";
</style>
